TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_uart.h
    /*! UART interrupt index for noise error */
    DL_UART_IIDX_NOISE_ERROR = UART_CPU_INT_IIDX_STAT_NERR_EVT,


    /*! UART interrupt index for no interrupt */
    DL_UART_IIDX_NO_INTERRUPT = UART_CPU_INT_IIDX_STAT_NO_INTR
} DL_UART_IIDX;

/*! @enum DL_UART_DMA_IIDX_RX */
typedef enum {
    /*! UART interrupt index for enabling UART receive as DMA trigger */
    DL_UART_DMA_IIDX_RX_TRIGGER = UART_DMA_TRIG_RX_IIDX_STAT_RXIFG,
    /*! UART interrupt index for enabling UART receive timeout as DMA trigger */
    DL_UART_DMA_IIDX_RX_TIMEOUT_TRIGGER = UART_DMA_TRIG_RX_IIDX_STAT_RTFG
} DL_UART_DMA_IIDX_RX;

/*! @enum DL_UART_DMA_IIDX_TX */
typedef enum {
    /*! UART interrupt index for enabling UART transmit as DMA trigger */
    DL_UART_DMA_IIDX_TX_TRIGGER = UART_DMA_TRIG_TX_IIDX_STAT_TXIFG
} DL_UART_DMA_IIDX_TX;

/** @addtogroup DL_UART_DMA_INTERRUPT_RX
 *  @{
 */
/*!
 * @brief UART interrupt for enabling UART receive as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_RX              (UART_DMA_TRIG_RX_IMASK_RXINT_SET)

/*!
 * @brief UART interrupt indicating DMA is done with the RX
 */
#define DL_UART_DMA_DONE_INTERRUPT_RX         (UART_CPU_INT_IMASK_DMA_DONE_RX_SET)

/*!
 * @brief UART interrupt for enabling UART receive timeout as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_RX_TIMEOUT      (UART_DMA_TRIG_RX_IMASK_RTOUT_SET)

/** @}*/

/*!
 * @brief UART interrupt for enabling UART transmit as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_TX              (UART_DMA_TRIG_TX_IMASK_TXINT_SET)

/*!
 * @brief UART interrupt indicating DMA is done with the TX
 */
#define DL_UART_DMA_DONE_INTERRUPT_TX         (UART_CPU_INT_IMASK_DMA_DONE_TX_SET)

/** @addtogroup DL_UART_ERROR
 *  @{
 */
/*!
 * @brief Overrun error ocurred
 */
#define DL_UART_ERROR_OVERRUN                          (UART_RXDATA_OVRERR_SET)

/*!
 * @brief Break error ocurred
 */
#define DL_UART_ERROR_BREAK                            (UART_RXDATA_BRKERR_SET)

/*!
 * @brief Parity error ocurred
 */
#define DL_UART_ERROR_PARITY                           (UART_RXDATA_PARERR_SET)

/*!
 * @brief Framing error ocurred
 */
#define DL_UART_ERROR_FRAMING                          (UART_RXDATA_FRMERR_SET)

/** @}*/

/*! @enum DL_UART_PULSE_WIDTH */
typedef enum {
    /*! Pulses shorter then 5ns length are filtered */
    DL_UART_PULSE_WIDTH_5_NS = UART_GFCTL_AGFSEL_AGLIT_5,
    /*! Pulses shorter then 10ns length are filtered */
    DL_UART_PULSE_WIDTH_10_NS = UART_GFCTL_AGFSEL_AGLIT_10,
    /*! Pulses shorter then 25ns length are filtered */
    DL_UART_PULSE_WIDTH_25_NS = UART_GFCTL_AGFSEL_AGLIT_25,
    /*! Pulses shorter then 50ns length are filtered */
    DL_UART_PULSE_WIDTH_50_NS = UART_GFCTL_AGFSEL_AGLIT_50
} DL_UART_PULSE_WIDTH;

/*! @enum DL_UART_OVERSAMPLING_RATE */
typedef enum {
    /*! Set oversampling rate to 16x */
    DL_UART_OVERSAMPLING_RATE_16X = UART_CTL0_HSE_OVS16,
    /*! Set oversampling rate to 8x */
    DL_UART_OVERSAMPLING_RATE_8X = UART_CTL0_HSE_OVS8,
    /*! Set oversampling rate to 3x.
     * IrDA, Manchester and DALI are not supported when 3x oversampling is
     * enabled. */
    DL_UART_OVERSAMPLING_RATE_3X = UART_CTL0_HSE_OVS3
} DL_UART_OVERSAMPLING_RATE;

/*! @enum DL_UART_PARITY */
typedef enum {
    /*! Enable even parity generation, checks for an even number of 1s */
    DL_UART_PARITY_EVEN = (UART_LCRH_PEN_ENABLE | UART_LCRH_EPS_EVEN),
    /*! Enable odd parity generation, checks for an odd number of 1s */
    DL_UART_PARITY_ODD = (UART_LCRH_PEN_ENABLE | UART_LCRH_EPS_ODD),
    /*! Enable stick parity with a parity bit of '1'
     * When enabled, a permanent '1' is set as parity when transmitting and
     * checked as '1' when receiving data. */
    DL_UART_PARITY_STICK_ONE = (UART_LCRH_PEN_ENABLE | UART_LCRH_SPS_ENABLE | UART_LCRH_EPS_ODD),
    /*! Enable stick parity with a parity bit of '0'
     * When enabled, a permanent '0' is set as parity when transmitting and
     * checked as '0' when receiving data. */
    DL_UART_PARITY_STICK_ZERO = (UART_LCRH_PEN_ENABLE | UART_LCRH_SPS_ENABLE | UART_LCRH_EPS_EVEN),
    /*! Disable parity checking and generation */
    DL_UART_PARITY_NONE = UART_LCRH_PEN_DISABLE
} DL_UART_PARITY;

/*! @enum DL_UART_WORD_LENGTH */
typedef enum {
    /*! Word length is 5 bits */
    DL_UART_WORD_LENGTH_5_BITS = UART_LCRH_WLEN_DATABIT5,
    /*! Word length is 6 bits */
    DL_UART_WORD_LENGTH_6_BITS = UART_LCRH_WLEN_DATABIT6,
    /*! Word length is 7 bits */
    DL_UART_WORD_LENGTH_7_BITS = UART_LCRH_WLEN_DATABIT7,
    /*! Word length is 8 bits */
    DL_UART_WORD_LENGTH_8_BITS = UART_LCRH_WLEN_DATABIT8
} DL_UART_WORD_LENGTH;

/*! @enum DL_UART_MODE */
typedef enum {
    /*! Normal operation */
    DL_UART_MODE_NORMAL = UART_CTL0_MODE_UART,
    /*! Operate in RS485 mode */
    DL_UART_MODE_RS485 = UART_CTL0_MODE_RS485,
    /*! Operate in Idle Line mode */
    DL_UART_MODE_IDLE_LINE = UART_CTL0_MODE_IDLELINE,
    /*! Operate in 9 Bit Address mode */
    DL_UART_MODE_ADDR_9_BIT = UART_CTL0_MODE_ADDR9BIT,
    /*! Operate in ISO7816 Smart Card Support mode */
    DL_UART_MODE_SMART_CARD = UART_CTL0_MODE_SMART,
    /*! Operate in DALI mode */
    DL_UART_MODE_DALI = UART_CTL0_MODE_DALI
} DL_UART_MODE;

/*! @enum DL_UART_DIRECTION */
typedef enum {
    /*! Enable UART transmitter */
    DL_UART_DIRECTION_TX = UART_CTL0_TXE_ENABLE,
    /*! Enable UART receiver */
    DL_UART_DIRECTION_RX = UART_CTL0_RXE_ENABLE,
    /*! Enable UART transmitter and receiver */
    DL_UART_DIRECTION_TX_RX = (UART_CTL0_RXE_ENABLE | UART_CTL0_TXE_ENABLE),
    /*! Disable UART transmitter and receiver */
    DL_UART_DIRECTION_NONE = (UART_CTL0_RXE_DISABLE | UART_CTL0_TXE_DISABLE)
} DL_UART_DIRECTION;

/*! @enum DL_UART_CLOCK */
typedef enum {
    /*! Selects BUSCLK as the clock source */
    DL_UART_CLOCK_BUSCLK = UART_CLKSEL_BUSCLK_SEL_ENABLE,
    /*! Selects MFCLK as the clock source */
    DL_UART_CLOCK_MFCLK = UART_CLKSEL_MFCLK_SEL_ENABLE,
    /*! Selects LFCLK as the clock source */
    DL_UART_CLOCK_LFCLK = UART_CLKSEL_LFCLK_SEL_ENABLE
} DL_UART_CLOCK;

/*! @enum DL_UART_FLOW_CONTROL */
typedef enum {
    /*! Enable request to send */
    DL_UART_FLOW_CONTROL_RTS = UART_CTL0_RTSEN_ENABLE,
    /*! Enable clear to send */
    DL_UART_FLOW_CONTROL_CTS = UART_CTL0_CTSEN_ENABLE,
    /*! Enable request to send and clear to send */
    DL_UART_FLOW_CONTROL_RTS_CTS = (UART_CTL0_RTSEN_ENABLE | UART_CTL0_CTSEN_ENABLE),
    /*! Disable flow control */
    DL_UART_FLOW_CONTROL_NONE = (UART_CTL0_CTSEN_DISABLE | UART_CTL0_RTSEN_DISABLE)
} DL_UART_FLOW_CONTROL;

/*! @enum DL_UART_RTS */
typedef enum {
    /*! RTS is asserted indicating data in RX FIFO is below threshold */
    DL_UART_RTS_ASSERT = UART_CTL0_RTS_SET,
    /*! RTS is deasserted indicating data in RX FIFO is at or above threshold */
    DL_UART_RTS_DEASSERT = UART_CTL0_RTS_CLR
} DL_UART_RTS;

/*! @enum DL_UART_STOP_BITS */
typedef enum {
    /*! One stop bit is transmitted at the end of the frame */
    DL_UART_STOP_BITS_ONE = UART_LCRH_STP2_DISABLE,
    /*! Two stop bits are transmitted at the end of the frame */
    DL_UART_STOP_BITS_TWO = UART_LCRH_STP2_ENABLE
} DL_UART_STOP_BITS;

/*! @enum DL_UART_TXD_OUT */
typedef enum {
    /*! TXD pin is low */
    DL_UART_TXD_OUT_LOW = UART_CTL0_TXD_OUT_LOW,
    /*! TXD pin is high */
    DL_UART_TXD_OUT_HIGH = UART_CTL0_TXD_OUT_HIGH
} DL_UART_TXD_OUT;

