TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_uart.h
    /*! Combination of UART Line Control Register configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. See @ref DL_UART_init for how the peripheral control word
     *  is created. */
    uint32_t lineControlRegisterWord;

    /*! Combination of UART glitch filter configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. */
    uint32_t glitchFilterControlWord;

    /*! UART interrupt mask for EVENT0.
     * Bitwise OR of @ref DL_UART_INTERRUPT */
    uint32_t interruptMask0;

    /*! UART interrupt mask for EVENT1.
     * Bitwise OR of @ref DL_UART_DMA_INTERRUPT_RX */
    uint32_t interruptMask1;

    /*! UART interrupt mask for EVENT2.
     * Bitwise OR of @ref DL_UART_DMA_INTERRUPT_TX */
    uint32_t interruptMask2;

    /*! Boolean flag indicating whether or not a valid configuration structure
     *  exists. Should not be modified by the user. */
    bool backupRdy;
} DL_UART_Main_backupConfig;

#endif /* __MSPM0_HAS_UART_MAIN__ */

#ifdef __MSPM0_HAS_UART_EXTD__

/**
 * @brief Configuration structure to backup UART Extend peripheral state before
 *        going to STOP/STANDBY mode. Used by
 *        @ref DL_UART_Extend_saveConfiguration and
 *        @ref DL_UART_Extend_restoreConfiguration
 */
typedef struct {
    /*! Combination of basic UART control configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. See @ref DL_UART_init for how the peripheral control word
     *  is created. */
    uint32_t controlWord;

    /*! UART module clock source. One of  @ref DL_UART_CLOCK */
    uint32_t clockSel;

    /*! UART clock divider. One of @ref DL_UART_CLOCK_DIVIDE_RATIO */
    uint32_t divideRatio;

    /*! Combination of UART Line Control Register configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. See @ref DL_UART_init for how the peripheral control word
     *  is created. */
    uint32_t lineControlRegisterWord;

    /*! Combination of UART interrupt FIFO level select configurations that are
     *  compressed to a single word as they are stored in the UART
     * registers. */
    uint32_t interruptFifoLevelSelectWord;

    /*! UART integer baud rate divisor. Value between 0 - 65535. */
    uint32_t ibrd;

    /*! UART fractional baud rate divisor. Value between 0 - 63. */
    uint32_t fbrd;

    /*! Combination of UART glitch filter configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. */
    uint32_t glitchFilterControlWord;

    /*! Combination of UART LIN basic configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. */
    uint32_t linControlWord;

    /*! Combination of UART IrDA basic configurations that are
     *  compressed to a single word as they are stored in the UART
     *  registers. */
    uint32_t irdaControlWord;

    /*! UART address mask for 9-bit or Idle mode. */
    uint32_t addressMask;

    /*! UART address that should be matched for 9-bit or Idle mode. */
    uint32_t address;

    /*! UART interrupt status for EVENT0.
     * Bitwise OR of @ref DL_UART_INTERRUPT */
    uint32_t interruptMask0;

    /*! UART interrupt status for EVENT1.
     * Bitwise OR of @ref DL_UART_DMA_INTERRUPT_RX */
    uint32_t interruptMask1;

    /*! UART interrupt status for EVENT2.
     * Bitwise OR of @ref DL_UART_DMA_INTERRUPT_TX */
    uint32_t interruptMask2;

    /*! Boolean flag indicating whether or not a valid configuration structure
     *  exists. Should not be modified by the user. */
    bool backupRdy;
} DL_UART_Extend_backupConfig;

#endif /* __MSPM0_HAS_UART_EXTD__ */

/**
 *  @brief      Initialize the UART peripheral
 *
 *  Initializes all the common configurable options for the UART peripheral. Any
 *  other custom configuration can be done after calling this API. The UART is
 *  not enabled in this API.
 *
 *  @param[in]  uart    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Configuration for UART peripheral
 */
void DL_UART_init(UART_Regs *uart, DL_UART_Config *config);

/**
 * @brief Enables power on UART module
 *
 * @param uart        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enablePower(UART_Regs *uart)
{
    uart->GPRCM.PWREN = (UART_PWREN_KEY_UNLOCK_W | UART_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on uart module
 *
 * @param uart        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disablePower(UART_Regs *uart)
{
    uart->GPRCM.PWREN = (UART_PWREN_KEY_UNLOCK_W | UART_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if  power on uart module
 *
 * @param uart        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_UART_isPowerEnabled(UART_Regs *uart)
{
    return ((uart->GPRCM.PWREN & UART_PWREN_ENABLE_MASK) ==
            UART_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets uart peripheral
 *
 * @param uart        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_reset(UART_Regs *uart)
{
    uart->GPRCM.RSTCTL =
        (UART_RSTCTL_KEY_UNLOCK_W | UART_RSTCTL_RESETSTKYCLR_CLR |
            UART_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if uart peripheral was reset
 *
 * @param uart        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_UART_isReset(UART_Regs *uart)
{
    return ((uart->GPRCM.STAT & UART_GPRCM_STAT_RESETSTKY_MASK) ==
            UART_GPRCM_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enable the UART peripheral
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enable(UART_Regs *uart)
{
    uart->CTL0 |= UART_CTL0_ENABLE_ENABLE;
}

/**
 *  @brief      Checks if the UART peripheral is enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the enabled status of the UART
 *
 *  @retval     true  The UART peripheral is enabled
 *  @retval     false The UART peripheral is disabled

 */
__STATIC_INLINE bool DL_UART_isEnabled(UART_Regs *uart)
{
    return ((uart->CTL0 & UART_CTL0_ENABLE_MASK) == UART_CTL0_ENABLE_ENABLE);
}

/**
 *  @brief      Disable the UART peripheral
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disable(UART_Regs *uart)
{
    uart->CTL0 &= ~(UART_CTL0_ENABLE_MASK);
}

/**
 *  @brief      Configure UART source clock
 *
 *  @param[in]  uart    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                       @ref DL_UART_ClockConfig.
 */
void DL_UART_setClockConfig(UART_Regs *uart, DL_UART_ClockConfig *config);

/**
 *  @brief      Get UART source clock configuration
 *
 *  @param[in]  uart    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_UART_ClockConfig.
 */
void DL_UART_getClockConfig(UART_Regs *uart, DL_UART_ClockConfig *config);

/**
 *  @brief      Configure the baud rate
 *
 *  Given the target baud rate and the frequency of the UART clock source, this
 *  API determines and sets the recommended oversampling setting, and then
 *  calculates and sets the required baud rate divisors.
 *
 * The oversampling rate that will be set is the highest possible oversampling
 * rate given the target baud rate and UART clock frequency.
 *
 * If the user wishes to avoid having the CPU calculate the baud rate divisors
 * or not use the recommended calculated values, the user can call
 * @ref DL_UART_setOversampling and @ref DL_UART_setBaudRateDivisor directly.
 *
 *  @param[in]  uart       Pointer to the register overlay for the peripheral
 *  @param[in]  clockFreq  The clock frequency in Hz of the UART clock source
 *  @param[in]  baudRate   The target baud rate
 *
 * @sa          DL_UART_setOversampling
 * @sa          DL_UART_setBaudRateDivisor
 */
void DL_UART_configBaudRate(
    UART_Regs *uart, uint32_t clockFreq, uint32_t baudRate);

/**
 *  @brief      Set the oversampling rate
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *  @param[in]  rate  The oversampling rate to use.
 *                    One of @ref DL_UART_OVERSAMPLING_RATE
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_setOversampling(
    UART_Regs *uart, DL_UART_OVERSAMPLING_RATE rate)
{
    DL_Common_updateReg(&uart->CTL0, (uint32_t) rate, UART_CTL0_HSE_MASK);
}

/**
 *  @brief      Get the oversampling rate
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The current oversampling rate
 *
 *  @retval     One of @ref DL_UART_OVERSAMPLING_RATE
 *
 */
__STATIC_INLINE DL_UART_OVERSAMPLING_RATE DL_UART_getOversampling(
    UART_Regs *uart)
{
    uint32_t rate = uart->CTL0 & UART_CTL0_HSE_MASK;

